import fs from 'fs';

export const CheckboxWords = [
  'Смелый',
  'Тихий',
  'Веселый',
  'Активный',
  'Общительный',
];



export const RadioQuestions = [
  {
    question: 'Как вы относитесь к общению во время путешествий на дальние расстояния?',
    answers: [
      'Я открыт(а) к общению и рад(а) новым знакомствам.',
      'Я предпочитаю общаться, если мой сосед захочет общения.',
      'Я предпочитаю путешествовать в тишине и не заводить новые знакомства в пути.',
    ],
  },
  {
    question: 'Как вы относитесь к шуму (люди разговаривают, дети играют) во время путешествий на поезде?',
    answers: [
      'Меня это не беспокоит.',
      'Я могу терпеть некоторый шум, но предпочитаю тишину.',
      'Мне важна абсолютная тишина.',
    ],
  },
  {
    question: 'У вас есть проблемы со здоровьем?',
    answers: [
      'Да.',
      'Нет.',
    ],
  },
  {
    question: 'Как вы относитесь к разделению места с домашними животными?',
    answers: [
      'Мне нравится, и я не против.',
      'Мне безразлично.',
      'Я против, у меня аллергия или другие причины.',
    ],
  },
  {
    question: 'Предпочитаете ли вы активные действия (читать, работать на ноутбуке, играть в игры) во время поездки или пассивный отдых (смотреть в окно, слушать музыку)?',
    answers: [
      'Активные действия.',
      'Пассивный отдых.',
      'Комбинированный.',
    ],
  },
  {
    question: 'Каков ваш дневной режим? Вы - "жаворонок" или "сова"?',
    answers: [
      'Жаворонок – я рано ложусь и рано встаю.',
      'Сова – я люблю поздно ложиться и не против спать до обеда.',
      'Мой график сна не имеет четкой регулярности.',
    ],
  },
  {
    question: 'Какие ваши предпочтения по поводу температуры в вагоне?',
    answers: [
      'Тепло.',
      'Умеренно.',
      'Прохладно.',
    ],
  },
  {
    question: 'Какие у вас предпочтения по подсветке в вагоне во время путешествия (яркая, тусклая, отсутствие)?',
    answers: [
      'Яркая.',
      'Тусклая.',
      'Отсутствие.',
    ],
  },
  {
    question: 'Во время путешествий вы, вероятно, сталкивались с различными неожиданными ситуациями. Какой из нижеперечисленных типов поведения вам наиболее близок в таких обстоятельствах?',
    answers: [
      'Я предпочитаю наблюдать и анализировать ситуацию, не вмешиваясь, пока кто-то другой не примет инициативу.',
      'Я склонен выразить свою заботу, возможно, словесно поддержать, но избегать активного участия.',
      'Я обычно один из первых, кто предлагает помощь, несмотря на характер ситуации.',
      'Я чувствую себя не комфортно в неожиданных ситуациях, но готов выйти из зоны комфорта, если обстоятельства требуют.',
    ],
  },
];

export const RadioInputQuestions = [
  {
    question: 'Есть ли у вас какие-либо аллергии или медицинские состояния, о которых должны знать ваши попутчики или проводник?',
    answers: [
      {
        text: 'Да.',
        input: {
          label: 'Уточните',
        },
      },
      {
        text: 'Нет.'
      }
    ]
  },
]

export const TagInputWords = ["каллиграфия", "свинг", "турагентства", "строительство", "реггетон", "хиппи", "фастфуды", "библиотековедение", "кикер", "авангард", "триумф", "стартапы", "самбо", "го", "чат", "эскейп-рум", "дрифт", "ракетостроение", "книги", "скейтбординг", "песапалло", "шашки", "зен", "сомелье", "открытки", "психотерапия", "рукописи", "рок", "коллаж", "джаз", "акватинта", "история", "интерьер", "офф-роуд", "карикатуры", "рыбалка", "аудиокнига", "хомяки", "припев", "ски-тур", "болеро", "ux/ui", "рекорд", "этнография", "радио", "оригами", "хористы", "писательство", "дискотеки", "переплёт", "вальсы", "этика", "митинг", "анимация", "рубик", "полька", "вечеринки", "бридж", "компасы", "иллюстраторы", "гаджеты", "декорирование", "физика", "коворкинг", "алгоритмы", "обучение", "роупджампинг", "элегия", "фехтование", "нумерология", "комедии", "блокчейн", "флешмоб", "сноубординг", "интернет", "достижение", "оркестр", "боулдеринг", "риторика", "сюрреализм", "вязание", "социология", "ботаника", "стрит-арт", "детокс", "маникюр", "велосипеды", "самокаты", "изобретения", "дзюдо", "каякинг", "биатлон", "ткачество", "легенды", "дадаизм", "диджеи", "астрономия", "квадрокоптеры", "моушн-дизайн", "фолклор", "веганство", "исследования", "корректоры", "солнце", "мультфильм", "зук", "сибит", "резьба", "форумы", "аутсорсинг", "маркировка", "филармонии", "джаз-модерн", "тату", "джиппинг", "макраме", "шитье", "фентези", "спорт", "эскапизм", "анбоксинг", "ветеринария", "редактирование", "музыкотерапия", "рестлинг", "парасейлинг", "туризм", "мастер-классы", "ужасы", "косметология", "стартап", "макрофотография", "бары", "фриланс", "магия", "автомоделизм", "художники", "филология", "скайдайвинг", "радио-шоу", "шифры", "метрономы", "подкаст", "аплодисменты", "djing", "рептилии", "автозвук", "цитата", "отели", "открытия", "рулетка", "фаер-шоу", "бачата", "лепка", "дирижёры", "озеленение", "триллеры", "скелетон", "фотожурналистика", "борьба", "крикет", "венера", "солярии", "экспозиция", "аквапарки", "кардио", "учеба", "камоги", "стипендии", "кафе", "фалеристика", "аллегория", "музыка", "кошки", "реклама", "реалити-шоу", "радиоспектакль", "чайные", "мода", "оркестровка", "инвестиции", "аниматор", "наука", "энкор", "ирония", "лайки", "влог", "пк", "футурология", "диктор", "скейтеры", "юпитер", "фрирайд", "баккара", "медитация", "пэчворк", "лидер", "бокс", "хештеги", "реализм", "эзотерика", "хендмейд", "барабаны", "инвестирование", "авиакомпании", "кунг-фу", "эстамп", "путешествия", "мим", "флорариумы", "крафт", "тай-чи", "парашютизм", "трибьют", "дебаты", "короткометражка", "ламбада", "беллиданс", "фигурки", "комментарии", "регби", "кубизм", "палеодиета", "глобусы", "выставка", "оперы", "вегетарианство", "квадроциклы", "орхидеи", "география", "фокстроты", "нанотехнологии", "музыковедение", "коллекционирование", "здоровье", "грим", "дирижабли", "статистика", "мессенджер", "сатурн", "биология", "подписчики", "репосты", "метафизика", "тюнинг", "гимнастика", "образ", "татуировка", "бодиарт", "криптовалюты", "волейбол", "паркур", "кето", "джайв", "боулинг", "шитьё", "премия", "иллюстрации", "символ", "книгоиздание", "буги-вуги", "кальянные", "плавание", "фристайл", "стихи", "археологи", "кости", "скиатлон", "саунд-арт", "авиадиспетчер", "темпера", "муай-тай", "автодром", "коммуникации", "pr", "триатлон", "трагедии", "награда", "казино", "лошади", "сёрферы", "экстрим", "комиксы", "импровизация", "выставки", "фестивали", "фламенко", "релаксация", "программирование", "рефери", "ярмарки", "клоун", "импрессионизм", "мкс", "астронавтика", "кинокритика", "икебана", "готы", "профилактории", "хайкинг", "спиннинг", "видеоарт", "проза", "сумо", "яхтинг", "монтаж", "звезды", "бисероплетение", "биотехнологии", "дайверы", "патронат", "таро", "латина", "грэпплинг", "инопланетяне", "сквош", "загадки", "путешественники", "уран", "ведущий", "гитара", "винтаж", "педагогика", "демонстрация", "телепроизводство", "садоводство", "фейерверки", "сольо", "лего", "стрим", "аналитика", "фольклор", "фотоискусство", "кизомба", "гейминг", "бис", "хэндмейд", "режиссура", "предания", "мюзиклы", "преферанс", "небо", "благотворительность", "каламбур", "сарказм", "мифология", "танго", "археология", "виндсёрфинг", "айкидо", "космология", "блэкджек", "прогнозирование", "шоу", "браво", "вышивка", "анекдоты", "скрипка", "судоку", "абстракционизм", "полиграфия", "кальчо", "тотализатор", "кинематограф", "мотоспорт", "менеджмент", "марафоны", "спорткомплексы", "карьера", "антропология", "рифма", "моделизм", "короткометражки", "видеоклипы", "кемпинг", "баскетбол", "пейзаж", "ориентирование", "метафора", "йога", "маунтинбайкинг", "цветотерапия", "зумба", "логотипы", "кумбия", "книговедение", "акупунктура", "радиолюбительство", "спецэффекты", "тамбурин", "тампопечать", "оценка", "ярмарка", "симпозиум", "продакшн", "спицы", "культурология", "корфбол", "кролики", "шинти", "гротеск", "консалтинг", "планеты", "масс-старт", "бариста", "марс", "бочче", "бобслей", "тиснение", "социологи", "стадионы", "ритм", "монеты", "пансионаты", "алгебра", "панк", "подкасты", "ремастеринг", "авиация", "уф-лакирование", "аутсайдер", "кето-диета", "скалолазание", "тренды", "стипендия", "хронометры", "издательство", "рэп", "милонга", "поэзия", "религия", "астрология", "дрессировка", "гандбол", "скрапбукинг", "чайлдфри", "агрономия", "астролябии", "скимбординг", "вокалисты", "галереи", "пикет", "степ", "птицеводство", "минимализм", "перевод", "сыроедение", "мифы", "аквариумы", "дельтапланеризм", "пивоварни", "фотография", "шахматы", "продюсирование", "кросс-кантри", "гипноз", "стимпанк", "телепатия", "продюсеры", "спа-салоны", "аптеки", "постмодернизм", "бонистика", "катамараны", "реторика", "блоггинг", "домоводство", "журналистика", "шелкография", "звание", "киберспорт", "конструктивизм", "музыканты", "кофейни", "редактура", "аукционы", "мозаика", "технологии", "парикмахерские", "реконструкция", "воркшопы", "шарады", "кубики", "массаж", "языки", "джиу-джитсу", "дирижирование", "хедхантинг", "хоккей", "химия", "пазл", "искусствоведение", "свингеры", "кендо", "лазертаг", "астероиды", "театрализация", "покер", "пилотирование", "сказки", "санки", "цирк", "керамика", "пикники", "генеалогия", "информатика", "урбанистика", "драмы", "журналисты", "бейсджампинг", "патенты", "кёрлинг", "вулканология", "хип-хоп", "брейкданс", "океанология", "геокэшинг", "эскрима", "гомеопатия", "сатира", "сети", "реставрация", "гидроциклы", "тамада", "нарды", "ремонт", "саундтреки", "аниме", "метеорология", "аукцион", "rpg", "картинг", "головоломки", "блог", "снукер", "графика", "кометы", "секстанты", "театры", "образование", "сноукайтинг", "кемпинги", "hr", "цирки", "логистика", "чтение", "стриминг", "психологи", "видеосъемка", "аэростатика", "квиллинг", "театроведение", "аранжировка", "рок-н-ролл", "капитан", "комментатор", "опера", "глайдеры", "луге", "пчеловодство", "кайтинг", "монотипия", "меценатство", "маркетинг", "архитектура", "лотерея", "поп", "тайны", "карнавал", "овации", "парапланеризм", "океанариумы", "искусство", "собаки", "библиофилия", "спонсорство", "экскурсии", "геометрия", "экспрессионизм", "диджеинг", "клоунада", "джоггинг", "предпринимательство", "менторинг", "иллюзии", "аргументация", "кали", "луна", "редакторы", "сюжет", "хёрлинг", "танцы", "поло", "строфа", "петанк", "террариумистика", "пауэрлифтинг", "титул", "коучинг", "марки", "обмены", "энергетика", "косплей", "маджонг", "булочные", "нептун", "хореография", "серфинг", "ребусы", "мастер-класс", "квесты", "пантомима", "пастораль", "гребля", "бейсбол", "палеонтология", "футзал", "брендинг", "diy", "тхэквондо", "ufo", "радиоастрономия", "бодибординг", "нетбол", "мультфильмы", "метр", "дискуссия", "пианино", "филателия", "стажировки", "краудсорсинг", "эпиграмма", "аквариумистика", "нумизматика", "металлисты", "плутон", "армрестлинг", "ранчо", "волонтерство", "животные", "фермы", "рукоделие", "карты", "экономика", "репортаж", "веб-разработка", "корабли", "спринт", "акватлон", "гольф", "ремикс", "краудфандинг", "панорама", "педикюр", "сон", "винил", "дискотека", "кураторы", "акваланг", "недвижимость", "политика", "кавер", "экстрасенсорика", "треккинг", "киберпанк", "хобби", "мобилизация", "автомобилестроение", "зоопарки", "историки", "зоопсихология", "авиамоделизм", "литература", "виндсерфинг", "ча-ча-ча", "психология", "спикер", "классика", "эмо", "маскарад", "румба", "бадминтон", "жонглирование", "ток-шоу", "моделирование", "метеориты", "домино", "хиромантия", "аюрведа", "астрал", "mmorpg", "самолеты", "киндер-сюрприз", "фантастика", "минералогия", "острота", "фэнтези", "бонсай", "басни", "звукозапись", "стрельба", "пилатес", "семба", "эпос", "манга", "столбики", "фитнес", "портрет", "топология", "шейпинг", "куплет", "инсталляция", "флорбол", "бег", "библиотеки", "конференция", "лидерство", "родео", "вин-чун", "пивоварение", "единоборства", "детективы", "таймлапс", "клубы", "концерты", "рокеры", "акробатика", "вексиллология", "арбитр", "мотоциклы", "конгрев", "насекомые", "сериалы", "космос", "гостеприимство", "кибернетика", "видеоклип", "будильники", "победа", "кроссворд", "юмор", "театр", "музеи", "мистика", "санатории", "варгейминг", "суши-бары", "запись", "робототехника", "фаворит", "оккультизм", "таэквондо", "логика", "мастеринг", "стюардесса", "фотосессии", "лыжи", "инновации", "рап", "виноделие", "литография", "семинар", "ребус", "кинопроизводство", "футуризм", "постапокалипсис", "стримеры", "рисование", "экология", "рафтинг", "аэротруба", "сальса", "трейлраннинг", "панки", "даунхилл", "головоломка", "композиторы", "ретро", "велотуризм", "ода", "рецитал", "ретрофутуризм", "брошюровка", "педагоги", "видеомонтаж", "антиквариат", "фотошоп", "грант", "софт", "польки", "суперспринт", "мамбо", "скульптура", "bmx", "кино", "гриль", "криптозоология", "камбэк", "пул", "ui/ux", "нло", "криптография", "драматерапия", "вертолеты", "кондитерские", "бильярд", "криптовалюта", "поп-арт", "волонтёрство", "ароматерапия", "эстетика", "трекинг", "баттл", "акварель", "философия", "пейнтбол", "биодинамика", "челлендж", "вышивание", "барбекю", "критики", "музееведение", "комедия", "пародия", "металл", "лыжероллеры", "3d-печать", "парад", "киноведение", "лирика", "иллюзионизм", "кулинария", "судья", "консоли", "граффити", "концерт", "сноркелинг", "фокусы", "варгейм", "каноэ", "ландшафт", "кибербезопасность", "футбол", "математика", "романы", "саундтрек", "галактики", "винодельни", "корреспонденты", "стилизация", "дуатлон", "снегоходы", "кораблестроение", "скутеры", "дроны", "пирсинг", "менторство", "гравюра", "стендап", "диетология", "велоспорт", "видеообзор", "автомобили", "паремии", "ралли", "анекдот", "дайвинг", "часы", "меренге", "нейронауки", "ламинация", "грызуны", "тренер", "афоризм", "созвездия", "лакросс", "планеризм", "визаж", "скульпторы", "дизайнеры", "ролики", "кинематография", "фестиваль", "консервация", "рестораны", "кайтсерфинг", "натюрморт", "коды", "рефлексотерапия", "кроссфит", "караоке", "сноубайк", "мотив", "марафон", "конференции", "копирайтинг", "эстафета", "подкастинг", "гонки", "банкноты", "спелеология", "крючок", "перформанс", "реванш", "аппликация", "приключения", "цигун", "семинары", "архивоведение", "арены", "саморазвитие", "космонавтика", "восхождение", "попперы", "генетика", "капоэйра", "палео", "пение", "пиццерии", "брейкеры", "декупаж", "трейдинг", "мимика", "дартс", "аэробика", "кайтсёрфинг", "ксилография", "аэростаты", "пиротехника", "кикбоксинг", "телевидение", "дельфинарии", "секундомеры", "балет", "бодибилдинг", "мототуризм", "электроника", "форум", "дизайн", "мемы", "звездопады", "астрофотография", "вебинар", "блогеры", "ясновидение", "хостелы", "веб-дизайн", "карате", "линогравюра", "активизм", "нетворкинг", "ракеты", "плантации", "антиутопия", "финансы", "экспертиза", "альпинизм", "живопись", "геология", "композиция", "утопия", "успех", "колумнисты", "террариумы", "фридайвинг", "самоирония", "флексопечать", "флористика", "вальс", "вейкбординг", "брейк-данс", "тестирование", "лингвисты", "охота", "воздухоплавание", "репортёры", "боди-арт", "кроссворды", "мультивселенная", "микс", "локеры", "автоспорт", "зоология", "баллада", "костюмирование", "фовизм", "теннис", "лингвистика", "режиссёры", "пабы", "типография", "астрофизика", "спутники", "звукорежиссура", "велотрек", "переводчики", "пермакультура", "гадание", "переследование", "видеоигры"].slice(0, 200);